## Plan Result (staging - TerraformPlanApply)




<pre><code>Plan: 2 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_route_table.this
  * azurerm_subnet_route_table_association.this
* Update
  * azurerm_linux_function_app.funcapp
  * module.storage.azurerm_storage_account.storage_account




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_linux_function_app.funcapp will be updated in-place
  ~ resource "azurerm_linux_function_app" "funcapp" {
      ~ app_settings                                   = {
          - "BUILD_FLAGS"                    = "UseExpressBuild" -> null
          - "ENABLE_ORYX_BUILD"              = "true" -> null
          - "SCM_DO_BUILD_DURING_DEPLOYMENT" = "1" -> null
          - "XDG_CACHE_HOME"                 = "/tmp/.cache" -> null
        }
        id                                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/baubais-data-factory-rg-stg/providers/Microsoft.Web/sites/baubais-stg-functionapp"
        name                                           = "baubais-stg-functionapp"
        tags                                           = {
            "application"  = "baubais"
            "builtFrom"    = "hmcts/juror-er-infra"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (32 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_route_table.this will be created
  + resource "azurerm_route_table" "this" {
      + bgp_route_propagation_enabled = true
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "rt-adf-function-stg"
      + resource_group_name           = "baubais-data-factory-rg-stg"
      + route                         = [
          + {
              + address_prefix         = "10.51.64.0/18"
              + name                   = "ss-demo-vnet"
              + next_hop_in_ip_address = "10.11.72.36"
              + next_hop_type          = "VirtualAppliance"
            },
        ]
      + subnets                       = (known after apply)
      + tags                          = {
          + "application"  = "baubais"
          + "builtFrom"    = "hmcts/juror-er-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
    }

  # azurerm_subnet_route_table_association.this will be created
  + resource "azurerm_subnet_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/baubais-data-factory-rg-stg/providers/Microsoft.Network/virtualNetworks/baubais-adf-vnet-stg/subnets/function-privateendpoints"
    }

  # module.storage.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/baubais-data-factory-rg-stg/providers/Microsoft.Storage/storageAccounts/synapsebaubaisstg"
        name                               = "synapsebaubaisstg"
        tags                               = {
            "application"  = "baubais"
            "builtFrom"    = "hmcts/juror-er-infra"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":18,"Program":"tfcmt","SHA1":"","Target":"staging - TerraformPlanApply","Vars":{}} -->